OpenFOAM-v2106/tutorials/incompressible/overPimpleDyMFoam/twoSimpleRotors/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default         none;
    div(phi,U)      Gauss upwind;

    div(phi,epsilon) Gauss limitedLinear 1;
    div(phi,k)       Gauss limitedLinear 1;

    div((nuEff*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected;
    laplacian(diffusivity,cellDisplacement)  Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

oversetInterpolation
{
    method          cellVolumeWeight;

    // Faster but less accurate
    //method              trackingInverseDistance;
    //searchBox           (0 0 0)(0.02 0.01 0.01);
    //searchBoxDivisions  3{(64 64 1)};
}

fluxRequired
{
    default         no;
    pcorr           ;
    p               ;
}

oversetInterpolationSuppressed
{
    grad(p);
    surfaceIntegrate(phiHbyA);
}


// ************************************************************************* //
